var city_data = {
  "区域": {
    "不限": "",
    "福田区": ["沙头", "南园", "园岭", "华富", "福田", "梅林", "香蜜湖", "莲花", "福保", "华强北"],
    "南山区": ["南头", "南山", "沙河", "西丽", "蛇口", "招商", "粤海", "桃园"],
    "龙岗区": ["平湖", "布吉", "坂田", "南湾", "横岗", "龙城", "龙岗", "坪地"],
    "宝安区": ["新安", "西乡", "福永", "沙井", "松岗", "石岩"],
    "罗湖区": ["黄贝", "桂圆", "东门", "翠竹", "东晓", "南湖", "笋岗", "东湖", "莲塘", "清水河"],
    "龙华新区": ["民治", "龙华", "大浪", "观湖", "福城", "观澜"],
    "盐田区": ["海山", "盐田", "海沙", "沙头角"],
    "光明新区": ["光明", "公明"],
    "坪山新区": ["坪山", "坑梓"],
    "大鹏新区": ["葵冲", "大鹏", "南澳"],
  },
  "地铁": {
    "1号线(罗宝线)": ["全部", "罗湖", "国贸", "老街", "大剧院", "科学馆", "华强路", "岗厦", "会展中心", "购物公园", "香蜜湖", "车公庙", "竹子林", "侨城东", "华侨城", "世界之窗", "白石洲", "高新园", "深大", "桃园", "大新", "鲤鱼门", "前海湾", "新安", "宝安中心", "宝体", "坪洲", "西乡", "固戍", "后瑞", "机场东", ],
    "2号线(蛇口线)": ["全部", "赤湾", "蛇口港", "海上世界", "水湾", "东角头", "湾厦", "海月", "登良", "后海", "科苑", "红树湾", "世界之窗", "侨城北", "深康", "安托山", "侨香", "香蜜", "香梅北", "景田", "莲花西", "福田", "市民中心", "岗厦北", "华强北", "燕南", "大剧院", "湖贝", "黄贝岭", "新秀"],
    "3号线(龙岗线)": ["全部", "益田", "石厦", "购物公园", "福田", "少年宫", "莲花村", "华新", "通新岭", "红岭", "老街", "晒布", "翠竹", "田贝", "水贝", "草埔", "布吉", "木棉湾", "大芬", "丹竹头", "六约", "塘坑", "横岗", "永湖", "荷坳", "大运", "爱联", "吉祥", "龙城广场", "南联", "双龙"],
    "4号线(龙华线)": ["全部", "清湖", "龙华", "龙胜", "上塘", "红山", "深圳北站", "白石龙", "民乐", "上梅林", "莲花北", "少年宫", "市民中心", "会展中心", "福民", "福田口岸"],
    "5号线(环中线)": ["全部", "黄贝岭", "怡景", "太安", "布心", "百鸽笼", "布吉", "长龙", "下水径", "上水径", "杨美", "坂田", "五和", "民治", "深圳北站", "长岭陂",
      "塘朗", "大学城", "西丽", "留仙洞", "兴东", "洪浪北", "灵芝", "翻身", "宝安中心", "宝华", "临海", "前海湾"
    ],
    "7号线(西丽线)": ["全部", "西丽湖", "西丽", "茶光", "珠光", "龙井", "桃源村", "深云", "安托山", "农林", "车公庙", "上沙", "沙尾", "石厦", "皇岗村", "福民", "皇岗口岸", "福邻(暂不开通)", "赤尾", "华强南", "华强北", "华新", "黄木岗", "八卦岭", "红岭北", "笋岗", "洪湖", "田贝", "太安", ],
    "9号线(梅林线)": ["全部", "红树湾南", "深湾", "深圳湾公园", "下沙", "车公庙", "香梅", "景田", "梅景", "下梅林", "梅村", "上梅林", "孖岭", "银湖", "泥岗", "红岭北",
      "园岭", "红岭", "红岭南", "鹿丹村", "人民南", "向西村", "文锦",
    ],
    "11号线(机场线)": ["全部", "福田", "车公庙", "红树湾南", "后海", "南山", "前海湾", "宝安", "碧海湾", "机场", "机场北", "福永", "桥头", "塘尾", "马安山", "沙井", "后亭", "松岗", "碧头", ]
  }
};


function getCity() {
  return city_data;
}

module.exports = {
  getCity: getCity
}